Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (128, 1536, 16)           64        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (128, 1536, 16)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (128, 1536, 16)           784       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (128, 1536, 16)           0         
_________________________________________________________________
average_pooling1d (AveragePo (128, 768, 16)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (128, 768, 32)            2592      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (128, 768, 32)            0         
_________________________________________________________________
conv1d_3 (Conv1D)            (128, 768, 32)            5152      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (128, 768, 32)            0         
_________________________________________________________________
average_pooling1d_1 (Average (128, 384, 32)            0         
_________________________________________________________________
conv1d_4 (Conv1D)            (128, 384, 64)            14400     
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (128, 384, 64)            0         
_________________________________________________________________
conv1d_5 (Conv1D)            (128, 384, 64)            28736     
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (128, 384, 64)            0         
_________________________________________________________________
average_pooling1d_2 (Average (128, 96, 64)             0         
_________________________________________________________________
flatten (Flatten)            (128, 6144)               0         
_________________________________________________________________
dense (Dense)                (128, 512)                3146240   
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (128, 512)                0         
_________________________________________________________________
dense_1 (Dense)              (128, 64)                 32832     
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (128, 64)                 0         
_________________________________________________________________
dense_2 (Dense)              (128, 16)                 1040      
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (128, 16)                 0         
_________________________________________________________________
dense_3 (Dense)              (128, 1)                  17        
=================================================================
Total params: 3,231,857
Trainable params: 0
Non-trainable params: 3,231,857
_________________________________________________________________
