Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 1, 22)]           0         
_________________________________________________________________
sequential_1 (Sequential)    (128, 1536, 1)            2414537   
_________________________________________________________________
multiply (Multiply)          (128, 1536, 1)            0         
_________________________________________________________________
sequential (Sequential)      (128, 1)                  3231857   
=================================================================
Total params: 5,646,394
Trainable params: 2,414,537
Non-trainable params: 3,231,857
_________________________________________________________________
