Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_4 (Dense)              (128, 1, 1536)            35328     
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (128, 1, 1536)            0         
_________________________________________________________________
reshape (Reshape)            (128, 24, 64)             0         
_________________________________________________________________
conv1d_transpose (Conv1DTran (128, 48, 32)             10272     
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (128, 48, 32)             0         
_________________________________________________________________
conv1d_transpose_1 (Conv1DTr (128, 96, 32)             5152      
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (128, 96, 32)             0         
_________________________________________________________________
conv1d_transpose_2 (Conv1DTr (128, 192, 16)            1552      
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (128, 192, 16)            0         
_________________________________________________________________
conv1d_transpose_3 (Conv1DTr (128, 384, 16)            784       
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (128, 384, 16)            0         
_________________________________________________________________
conv1d_transpose_4 (Conv1DTr (128, 768, 8)             392       
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (128, 768, 8)             0         
_________________________________________________________________
conv1d_transpose_5 (Conv1DTr (128, 1536, 8)            200       
_________________________________________________________________
leaky_re_lu_15 (LeakyReLU)   (128, 1536, 8)            0         
_________________________________________________________________
conv1d_transpose_6 (Conv1DTr (128, 1536, 1)            25        
_________________________________________________________________
leaky_re_lu_16 (LeakyReLU)   (128, 1536, 1)            0         
_________________________________________________________________
flatten_1 (Flatten)          (128, 1536)               0         
_________________________________________________________________
dense_5 (Dense)              (128, 1536)               2360832   
_________________________________________________________________
leaky_re_lu_17 (LeakyReLU)   (128, 1536)               0         
_________________________________________________________________
reshape_1 (Reshape)          (128, 1536, 1)            0         
=================================================================
Total params: 2,414,537
Trainable params: 2,414,537
Non-trainable params: 0
_________________________________________________________________
