Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_6 (Conv1D)            (128, 1536, 16)           64        
_________________________________________________________________
leaky_re_lu_18 (LeakyReLU)   (128, 1536, 16)           0         
_________________________________________________________________
conv1d_7 (Conv1D)            (128, 1536, 16)           784       
_________________________________________________________________
leaky_re_lu_19 (LeakyReLU)   (128, 1536, 16)           0         
_________________________________________________________________
average_pooling1d_3 (Average (128, 768, 16)            0         
_________________________________________________________________
conv1d_8 (Conv1D)            (128, 768, 32)            2592      
_________________________________________________________________
leaky_re_lu_20 (LeakyReLU)   (128, 768, 32)            0         
_________________________________________________________________
conv1d_9 (Conv1D)            (128, 768, 32)            5152      
_________________________________________________________________
leaky_re_lu_21 (LeakyReLU)   (128, 768, 32)            0         
_________________________________________________________________
average_pooling1d_4 (Average (128, 384, 32)            0         
_________________________________________________________________
conv1d_10 (Conv1D)           (128, 384, 64)            14400     
_________________________________________________________________
leaky_re_lu_22 (LeakyReLU)   (128, 384, 64)            0         
_________________________________________________________________
conv1d_11 (Conv1D)           (128, 384, 64)            28736     
_________________________________________________________________
leaky_re_lu_23 (LeakyReLU)   (128, 384, 64)            0         
_________________________________________________________________
average_pooling1d_5 (Average (128, 96, 64)             0         
_________________________________________________________________
flatten_2 (Flatten)          (128, 6144)               0         
_________________________________________________________________
dense_6 (Dense)              (128, 512)                3146240   
_________________________________________________________________
leaky_re_lu_24 (LeakyReLU)   (128, 512)                0         
_________________________________________________________________
dense_7 (Dense)              (128, 64)                 32832     
_________________________________________________________________
leaky_re_lu_25 (LeakyReLU)   (128, 64)                 0         
_________________________________________________________________
dense_8 (Dense)              (128, 16)                 1040      
_________________________________________________________________
leaky_re_lu_26 (LeakyReLU)   (128, 16)                 0         
_________________________________________________________________
dense_9 (Dense)              (128, 1)                  17        
=================================================================
Total params: 3,231,857
Trainable params: 0
Non-trainable params: 3,231,857
_________________________________________________________________
