Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_10 (Dense)             (128, 1, 1536)            35328     
_________________________________________________________________
leaky_re_lu_27 (LeakyReLU)   (128, 1, 1536)            0         
_________________________________________________________________
reshape_2 (Reshape)          (128, 24, 64)             0         
_________________________________________________________________
conv1d_transpose_7 (Conv1DTr (128, 48, 32)             10272     
_________________________________________________________________
leaky_re_lu_28 (LeakyReLU)   (128, 48, 32)             0         
_________________________________________________________________
conv1d_transpose_8 (Conv1DTr (128, 96, 32)             5152      
_________________________________________________________________
leaky_re_lu_29 (LeakyReLU)   (128, 96, 32)             0         
_________________________________________________________________
conv1d_transpose_9 (Conv1DTr (128, 192, 16)            1552      
_________________________________________________________________
leaky_re_lu_30 (LeakyReLU)   (128, 192, 16)            0         
_________________________________________________________________
conv1d_transpose_10 (Conv1DT (128, 384, 16)            784       
_________________________________________________________________
leaky_re_lu_31 (LeakyReLU)   (128, 384, 16)            0         
_________________________________________________________________
conv1d_transpose_11 (Conv1DT (128, 768, 8)             392       
_________________________________________________________________
leaky_re_lu_32 (LeakyReLU)   (128, 768, 8)             0         
_________________________________________________________________
conv1d_transpose_12 (Conv1DT (128, 1536, 8)            200       
_________________________________________________________________
leaky_re_lu_33 (LeakyReLU)   (128, 1536, 8)            0         
_________________________________________________________________
conv1d_transpose_13 (Conv1DT (128, 1536, 1)            25        
_________________________________________________________________
leaky_re_lu_34 (LeakyReLU)   (128, 1536, 1)            0         
_________________________________________________________________
flatten_3 (Flatten)          (128, 1536)               0         
_________________________________________________________________
dense_11 (Dense)             (128, 1536)               2360832   
_________________________________________________________________
leaky_re_lu_35 (LeakyReLU)   (128, 1536)               0         
_________________________________________________________________
reshape_3 (Reshape)          (128, 1536, 1)            0         
=================================================================
Total params: 2,414,537
Trainable params: 2,414,537
Non-trainable params: 0
_________________________________________________________________
